programming/c/notes/c-keywords.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>c keywords</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">c keywords</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5c5a971">TYPES</a></li>
<li><a href="#orgee34830">FLOW</a></li>
<li><a href="#orgf416970">SCOPE</a></li>
<li><a href="#orgf2ceefc">known</a></li>
<li><a href="#org8b1e0ca">unknown</a></li>
</ul>
</div>
</div>
<p>
there are 32 keywords
</p>

<div id="outline-container-org5c5a971" class="outline-2">
<h2 id="org5c5a971">TYPES</h2>
<div class="outline-text-2" id="text-org5c5a971">
<ul class="org-ul">
<li>int</li>
<li>char</li>
<li>float</li>
<li>double</li>
<li>const</li>
<li>long</li>
<li>short</li>
<li>unsigned</li>
<li>signed</li>
<li>void</li>
</ul>
</div>
</div>

<div id="outline-container-orgee34830" class="outline-2">
<h2 id="orgee34830">FLOW</h2>
<div class="outline-text-2" id="text-orgee34830">
<ul class="org-ul">
<li>break</li>
<li>case</li>
<li>continue</li>
<li>do</li>
<li>else</li>
<li>for</li>
<li>goto</li>
<li>if</li>
<li>switch</li>
<li>return</li>
<li>while</li>
</ul>
</div>
</div>

<div id="outline-container-orgf416970" class="outline-2">
<h2 id="orgf416970">SCOPE</h2>
<div class="outline-text-2" id="text-orgf416970">
<ul class="org-ul">
<li>auto
<ul class="org-ul">
<li>automatic variable.</li>
<li>variable exists and can only be accessed inside the block</li>
<li>destroyed after exiting the block</li>
</ul></li>
<li>extern
<ul class="org-ul">
<li>explicitly available for the entire program</li>
<li>global</li>
</ul></li>
<li>static
<ul class="org-ul">
<li>available to all functions etc in the same file.  not accessible
outside the file</li>
<li>eg use in headers or sharing variables between functions</li>
</ul></li>
</ul>

<p>
q. what is the default behaviour?
</p>
<ul class="org-ul">
<li>when to use these keywords?</li>
</ul>
</div>
</div>

<div id="outline-container-orgf2ceefc" class="outline-2">
<h2 id="orgf2ceefc">known</h2>
<div class="outline-text-2" id="text-orgf2ceefc">
<ul class="org-ul">
<li>struct</li>
<li>typedef</li>
<li>sizeof</li>
</ul>
</div>
</div>

<div id="outline-container-org8b1e0ca" class="outline-2">
<h2 id="org8b1e0ca">unknown</h2>
<div class="outline-text-2" id="text-org8b1e0ca">
<ul class="org-ul">
<li>default</li>
<li>enum</li>
<li>register</li>
<li>union</li>
<li>volatile</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
